IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_DAC0_CONTROLSS_DAC0.xml
<module name="CONTROLSS_DAC0_CONTROLSS_DAC0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_DAC0_DACREV" acronym="CONTROLSS_DAC0_DACREV" offset="0x0" width="16" description="">
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="DAC Revision" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_DAC0_DACCTL_ALT2_" acronym="CONTROLSS_DAC0_DACCTL_ALT2_" offset="0x2" width="16" description="">
		<bitfield id="SYNCSEL" width="5" begin="8" end="4" resetval="0x0" description="DAC EPWMSYNCPER select. Determines which EPWMSYNCPER signal will update the DACVALA register. Where n represents the maximum number of EPWMSYNCPER signals available on the device:     0  EPWM1SYNCPER    1  EPWM2SYNCPER    2  EPWM3SYNCPER  ...  n-1  EPWMnSYNCPER" range="8 - 4" rwaccess="RW"/> 
		<bitfield id="LOADMODE" width="1" begin="2" end="2" resetval="0x0" description="DACVALA load mode. Determines when the DACVALA register is updated with the value from DACVALS.   0  Load on next SYSCLK  1  Load on next EPWMSYNCPER specified by SYNCSEL" range="2" rwaccess="RW"/> 
		<bitfield id="MODE" width="1" begin="1" end="1" resetval="0x0" description="DAC gain mode select. Selects the gain mode for the buffered output.  The MODE value is only used when DACREFSEL=1 and internal ADC reference mode is selected.   0  Gain is 1  1  Gain is 2" range="1" rwaccess="RW"/> 
		<bitfield id="DACREFSEL" width="1" begin="0" end="0" resetval="0x0" description="DAC reference select. Selects which voltage references are used by the DAC.   0  VDAC/VSSA are the reference voltages  1  ADC VREFHI/VSSA are the reference voltages" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DAC0_DACVALA" acronym="CONTROLSS_DAC0_DACVALA" offset="0x4" width="16" description="">
		<bitfield id="DACVALA" width="12" begin="11" end="0" resetval="0x0" description="Active output code currently driven by the DAC" range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_DAC0_DACVALS" acronym="CONTROLSS_DAC0_DACVALS" offset="0x6" width="16" description="">
		<bitfield id="DACVALS" width="12" begin="11" end="0" resetval="0x0" description="Shadow output code to be loaded into DACVALA" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DAC0_DACOUTEN" acronym="CONTROLSS_DAC0_DACOUTEN" offset="0x8" width="16" description="">
		<bitfield id="DACOUTEN" width="1" begin="0" end="0" resetval="0x0" description="DAC output enable   0  DAC output is disabled  1  DAC output is enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DAC0_DACLOCK" acronym="CONTROLSS_DAC0_DACLOCK" offset="0xA" width="16" description="">
		<bitfield id="KEY" width="4" begin="15" end="12" resetval="0x0" description="Writes to this register succeed only if this field is written with a value of 0xA. Only 16-bit writes will succeed (provided the KEY matches). Read-modify-writes to individual bits in this register will be ignored." range="15 - 12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="DACOUTEN" width="1" begin="2" end="2" resetval="0x0" description="Lock write-access to the DACOUTEN register.   0  DACOUTEN register is not locked. Write 0 to this bit has no effect.  1  DACOUTEN register is locked. Only a system reset can clear this bit." range="2" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="DACVAL" width="1" begin="1" end="1" resetval="0x0" description="Lock write-access to the DACVALS register.   0  DACVALS register is not locked. Write 0 to this bit has no effect.  1  DACVALS register is locked. Only a system reset can clear this bit." range="1" rwaccess="RW
	  			 SONCE"/> 
		<bitfield id="DACCTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the DACCTL register.   0  DACCTL register is not locked. Write 0 to this bit has no effect.  1  DACCTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="RW
	  			 SONCE"/>
	</register>
	<register id="CONTROLSS_DAC0_DACTRIM" acronym="CONTROLSS_DAC0_DACTRIM" offset="0xC" width="16" description="">
		<bitfield id="RESERVED" width="4" begin="11" end="8" resetval="0x0" description="DAC Gain Trim. This signed (two's complement) bit field is used to adjust the gain of the DAC. This register will be written with a factory set value during the device boot procedure.   1000  Gain is increased by the equivalent of 0.8%  ...  1110  Gain is increased by the equivalent of 0.2% LSB  1111  Gain is increased by the equivalent of 0.1% LSB  0000  Gain is not adjusted  0001  Gain is decreased by the equivalent of 0.1% LSB  0010  Gain is decreased by the equivalent of 0.2% LSB  ...  0111  Gain is decreased by the equivalent of 0.7% LSB" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="OFFSET_TRIM" width="8" begin="7" end="0" resetval="0x0" description="DAC Offset Trim. This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="7 - 0" rwaccess="RW"/>
	</register>
</module>